neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBUserClient.cpp
/*
 * Copyright (c) 1998-2000 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * The contents of this file constitute Original Code as defined in and
 * are subject to the Apple Public Source License Version 1.1 (the
 * "License").  You may not use this file except in compliance with the
 * License.  Please obtain a copy of the License at
 * http://www.apple.com/publicsource and read it before using this file.
 * 
 * This Original Code and all software distributed under the License are
 * distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
 * License for the specific language governing rights and limitations
 * under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */
/*
 * Copyright (c) 1999 Apple Computer, Inc.  All rights reserved.
 *
 * HISTORY
 * 16 Mar 1999 wgulland created.
 *
 */
#include <libkern/OSByteOrder.h>

#include <IOKit/assert.h>
#include <IOKit/IOLib.h>
#include <IOKit/IOBufferMemoryDescriptor.h>
#include <IOKit/usb/IOUSBDevice.h>
#include <IOKit/usb/IOUSBInterface.h>
#include <IOKit/usb/IOUSBPipe.h>

#include "IOUSBUserClient.h"

#define super IOUserClient
#define DEBUGGING_LEVEL 0

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

OSDefineMetaClass( IOUSBUserClient, IOUserClient )
OSDefineAbstractStructors(IOUSBUserClient, IOUserClient)

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

bool IOUSBUserClient::start( IOService * provider )
{
    IOUSBNub *owner = OSDynamicCast(IOUSBNub, provider);

    assert(owner);
    if(!super::start(provider))
        return false;

    fPipes[0] = owner->pipeZero();
    if(!fPipes[0])
	return false;

    // Initialize the call structures valid for IOUSBNub
    fMethods[kUSBSetConfig].object = NULL;
    fMethods[kUSBSetConfig].func = NULL;
    fMethods[kUSBSetConfig].count0 = 1;
    fMethods[kUSBSetConfig].count1 = 0;
    fMethods[kUSBSetConfig].flags = kIOUCScalarIScalarO;

    fMethods[kUSBGetConfig].object = provider;
    fMethods[kUSBGetConfig].func = (IOMethod)&IOUSBNub::GetConfiguration;
    fMethods[kUSBGetConfig].count0 = 0;
    fMethods[kUSBGetConfig].count1 = 1;
    fMethods[kUSBGetConfig].flags = kIOUCScalarIScalarO;

    fMethods[kUSBGetConfigDescriptor].object = NULL;
    fMethods[kUSBGetConfigDescriptor].func = NULL;
    fMethods[kUSBGetConfigDescriptor].count0 = 1;
    fMethods[kUSBGetConfigDescriptor].count1 = 0xffffffff; // variable
    fMethods[kUSBGetConfigDescriptor].flags = kIOUCScalarIStructO;

    fMethods[kUSBControlReqOut].object = this;
    fMethods[kUSBControlReqOut].func =
        (IOMethod)&IOUSBUserClient::ControlReqOut;
    fMethods[kUSBControlReqOut].count0 = 4;
    fMethods[kUSBControlReqOut].count1 = 0xffffffff; // variable
    fMethods[kUSBControlReqOut].flags = kIOUCScalarIStructI;

    fMethods[kUSBControlReqIn].object = this;
    fMethods[kUSBControlReqIn].func =
        (IOMethod)&IOUSBUserClient::ControlReqIn;
    fMethods[kUSBControlReqIn].count0 = 4;
    fMethods[kUSBControlReqIn].count1 = 0xffffffff; // variable
    fMethods[kUSBControlReqIn].flags = kIOUCScalarIStructO;

    fMethods[kUSBOpenPipe].object = NULL;
    fMethods[kUSBOpenPipe].func = NULL;
    fMethods[kUSBOpenPipe].count0 = 4;
    fMethods[kUSBOpenPipe].count1 = 1;
    fMethods[kUSBOpenPipe].flags = kIOUCScalarIScalarO;

    fMethods[kUSBClosePipe].object = this;
    fMethods[kUSBClosePipe].func =
        (IOMethod)&IOUSBUserClient::ClosePipe;
    fMethods[kUSBClosePipe].count0 = 1;
    fMethods[kUSBClosePipe].count1 = 0;
    fMethods[kUSBClosePipe].flags = kIOUCScalarIScalarO;

    fMethods[kUSBReadPipe].object = this;
    fMethods[kUSBReadPipe].func =
        (IOMethod)&IOUSBUserClient::ReadPipe;
    fMethods[kUSBReadPipe].count0 = 1;
    fMethods[kUSBReadPipe].count1 = 0xffffffff; // variable
    fMethods[kUSBReadPipe].flags = kIOUCScalarIStructO;

    fMethods[kUSBWritePipe].object = this;
    fMethods[kUSBWritePipe].func =
        (IOMethod)&IOUSBUserClient::WritePipe;
    fMethods[kUSBWritePipe].count0 = 1;
    fMethods[kUSBWritePipe].count1 = 0xffffffff; // variable
    fMethods[kUSBWritePipe].flags = kIOUCScalarIStructI;

    fMethods[kUSBGetPipeStatus].object = this;
    fMethods[kUSBGetPipeStatus].func =
        (IOMethod)&IOUSBUserClient::getPipeStatus;
    fMethods[kUSBGetPipeStatus].count0 = 1;
    fMethods[kUSBGetPipeStatus].count1 = 0;
    fMethods[kUSBGetPipeStatus].flags = kIOUCScalarIScalarO;

    fMethods[kUSBAbortPipe].object = this;
    fMethods[kUSBAbortPipe].func =
        (IOMethod)&IOUSBUserClient::abortPipe;
    fMethods[kUSBAbortPipe].count0 = 1;
    fMethods[kUSBAbortPipe].count1 = 0;
    fMethods[kUSBAbortPipe].flags = kIOUCScalarIScalarO;

    fMethods[kUSBResetPipe].object = this;
    fMethods[kUSBResetPipe].func =
        (IOMethod)&IOUSBUserClient::resetPipe;
    fMethods[kUSBResetPipe].count0 = 1;
    fMethods[kUSBResetPipe].count1 = 0;
    fMethods[kUSBResetPipe].flags = kIOUCScalarIScalarO;

    fMethods[kUSBSetPipeIdle].object = this;
    fMethods[kUSBSetPipeIdle].func =
        (IOMethod)&IOUSBUserClient::setPipeIdle;
    fMethods[kUSBSetPipeIdle].count0 = 1;
    fMethods[kUSBSetPipeIdle].count1 = 0;
    fMethods[kUSBSetPipeIdle].flags = kIOUCScalarIScalarO;

    fMethods[kUSBSetPipeActive].object = this;
    fMethods[kUSBSetPipeActive].func =
        (IOMethod)&IOUSBUserClient::setPipeActive;
    fMethods[kUSBSetPipeActive].count0 = 1;
    fMethods[kUSBSetPipeActive].count1 = 0;
    fMethods[kUSBSetPipeActive].flags = kIOUCScalarIScalarO;

    fMethods[kUSBClearPipeStall].object = this;
    fMethods[kUSBClearPipeStall].func =
        (IOMethod)&IOUSBUserClient::clearPipeStall;
    fMethods[kUSBClearPipeStall].count0 = 1;
    fMethods[kUSBClearPipeStall].count1 = 0;
    fMethods[kUSBClearPipeStall].flags = kIOUCScalarIScalarO;

    fMethods[kUSBReadPipeOOL].object = this;
    fMethods[kUSBReadPipeOOL].func =
        (IOMethod)&IOUSBUserClient::ReadPipeOOL;
    fMethods[kUSBReadPipeOOL].count0 = 3;
    fMethods[kUSBReadPipeOOL].count1 = 1;
    fMethods[kUSBReadPipeOOL].flags = kIOUCScalarIScalarO;

    fAsyncMethods[kUSBReadPipeOOL].object = this;
    fAsyncMethods[kUSBReadPipeOOL].func =
        (IOAsyncMethod)&IOUSBUserClient::ReadPipeAsync;
    fAsyncMethods[kUSBReadPipeOOL].count0 = 3;
    fAsyncMethods[kUSBReadPipeOOL].count1 = 0;
    fAsyncMethods[kUSBReadPipeOOL].flags = kIOUCScalarIScalarO;

    fMethods[kUSBWritePipeOOL].object = this;
    fMethods[kUSBWritePipeOOL].func =
        (IOMethod)&IOUSBUserClient::WritePipeOOL;
    fMethods[kUSBWritePipeOOL].count0 = 3;
    fMethods[kUSBWritePipeOOL].count1 = 0;
    fMethods[kUSBWritePipeOOL].flags = kIOUCScalarIScalarO;

    fAsyncMethods[kUSBWritePipeOOL].object = this;
    fAsyncMethods[kUSBWritePipeOOL].func =
        (IOAsyncMethod)&IOUSBUserClient::WritePipeAsync;
    fAsyncMethods[kUSBWritePipeOOL].count0 = 3;
    fAsyncMethods[kUSBWritePipeOOL].count1 = 0;
    fAsyncMethods[kUSBWritePipeOOL].flags = kIOUCScalarIScalarO;

    fMethods[kUSBControlReqInOOL].object = this;
    fMethods[kUSBControlReqInOOL].func =
        (IOMethod)&IOUSBUserClient::ControlReqInOOL;
    fMethods[kUSBControlReqInOOL].count0 = sizeof(DevReqOOL);
    fMethods[kUSBControlReqInOOL].count1 = sizeof(UInt32);
    fMethods[kUSBControlReqInOOL].flags = kIOUCStructIStructO;

    fAsyncMethods[kUSBControlReqInOOL].object = this;
    fAsyncMethods[kUSBControlReqInOOL].func =
        (IOAsyncMethod)&IOUSBUserClient::ControlReqInAsync;
    fAsyncMethods[kUSBControlReqInOOL].count0 = sizeof(DevReqOOL);
    fAsyncMethods[kUSBControlReqInOOL].count1 = 0;
    fAsyncMethods[kUSBControlReqInOOL].flags = kIOUCStructIStructO;

    fMethods[kUSBControlReqOutOOL].object = this;
    fMethods[kUSBControlReqOutOOL].func =
        (IOMethod)&IOUSBUserClient::ControlReqOutOOL;
    fMethods[kUSBControlReqOutOOL].count0 = sizeof(DevReqOOL);
    fMethods[kUSBControlReqOutOOL].count1 = 0;
    fMethods[kUSBControlReqOutOOL].flags = kIOUCStructIStructO;

