neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBUserClient.cpp
    fAsyncMethods[kUSBControlReqOutOOL].object = this;
    fAsyncMethods[kUSBControlReqOutOOL].func =
        (IOAsyncMethod)&IOUSBUserClient::ControlReqOutAsync;
    fAsyncMethods[kUSBControlReqOutOOL].count0 = sizeof(DevReqOOL);
    fAsyncMethods[kUSBControlReqOutOOL].count1 = 0;
    fAsyncMethods[kUSBControlReqOutOOL].flags = kIOUCStructIStructO;


    fMethods[kUSBResetDevice].object = NULL;
    fMethods[kUSBResetDevice].func = NULL;
    fMethods[kUSBResetDevice].count0 = 0;
    fMethods[kUSBResetDevice].count1 = 0;
    fMethods[kUSBResetDevice].flags = kIOUCScalarIScalarO;

    return true;
}

IOExternalMethod *
IOUSBUserClient::getExternalMethodForIndex( UInt32 index )
{
    if(index >= kNumUSBMethods || fMethods[index].object == NULL)
    	return NULL;
    else
        return &fMethods[index];
}

IOExternalAsyncMethod *
IOUSBUserClient::getExternalAsyncMethodForIndex( UInt32 index )
{
    if(index >= kNumUSBMethods || fAsyncMethods[index].object == NULL)
        return NULL;
    else
        return &fAsyncMethods[index];
}

/*
 * There's a limit of max 6 arguments to user client methods, so the type, recipient and request
 * are packed into one 16 bit integer.
 */
IOReturn
IOUSBUserClient::ControlReqIn(UInt32 pipe, UInt16 bmreqtypeRequest, UInt16 wValue,
		UInt16 wIndex, void *buf, UInt32 *size)
{
    IOReturn res;
    IOUSBDevRequest	req;
    IOUSBPipe *pipeObj;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    req.rqDirection = kUSBIn;
    req.rqType = (bmreqtypeRequest >> kUSBRqTypeShift) & kUSBRqTypeMask;
    req.rqRecipient = bmreqtypeRequest & kUSBRqRecipientMask;
    req.bRequest = bmreqtypeRequest >> 8;
    OSWriteLittleInt16(&req.wValue, 0, wValue);
    OSWriteLittleInt16(&req.wIndex, 0, wIndex);
    OSWriteLittleInt16(&req.wLength, 0, *size);
    req.pData = buf;
    res = pipeObj->controlRequest(&req);

    if(res == kIOReturnSuccess) {
        *size = req.wLenDone;
    }
    else {
        IOLog("IOUSBUserClient::ControlReqIn err:0x%x\n", res);
        *size = 0;
    }
    return res;
}

/*
 * There's a limit of max 6 arguments to user client methods, so the type, recipient and request
 * are packed into one 16 bit integer.
 */
IOReturn
IOUSBUserClient::ControlReqOut(UInt32 pipe, UInt16 bmreqtypeRequest, UInt16 wValue,
                UInt16 wIndex, void *buf, UInt32 size)
{
    IOReturn res;
    IOUSBDevRequest	req;
    IOUSBPipe *pipeObj;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    req.rqDirection = kUSBOut;
    req.rqType = (bmreqtypeRequest >> kUSBRqTypeShift) & kUSBRqTypeMask;
    req.rqRecipient = bmreqtypeRequest & kUSBRqRecipientMask;
    req.bRequest = bmreqtypeRequest >> 8;
    OSWriteLittleInt16(&req.wValue, 0, wValue);
    OSWriteLittleInt16(&req.wIndex, 0, wIndex);
    OSWriteLittleInt16(&req.wLength, 0, size);
    req.pData = buf;
    res = pipeObj->controlRequest(&req);

    if(kIOReturnSuccess != res) {
        IOLog("IOUSBUserClient::ControlReqOut err:0x%x\n", res);
    }
    return res;
}

IOReturn
IOUSBUserClient::ControlReqInOOL(DevReqOOL *reqIn, UInt32 *sizeOut, IOByteCount inCount,
                                IOByteCount *outCount)
{
    IOReturn 			res;
    IOUSBDevRequestDesc		req;
    IOMemoryDescriptor *	mem;
    IOUSBPipe *			pipeObj;

    if(inCount != sizeof(DevReqOOL) ||
       *outCount != sizeof(UInt32))
        return kIOReturnBadArgument;

    pipeObj = fPipes[reqIn->pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    mem = IOMemoryDescriptor::withAddress((vm_address_t)reqIn->buf, reqIn->sizeIn,
                                          kIODirectionIn,
                                          fTask);
    if(!mem) {
        return kIOReturnNoMemory;
    }
    req.rqDirection = kUSBIn;
    req.rqType = (reqIn->bmreqtype >> kUSBRqTypeShift) & kUSBRqTypeMask;
    req.rqRecipient = reqIn->bmreqtype & kUSBRqRecipientMask;
    req.bRequest = reqIn->request;
    OSWriteLittleInt16(&req.wValue, 0, reqIn->wValue);
    OSWriteLittleInt16(&req.wIndex, 0, reqIn->wIndex);
    OSWriteLittleInt16(&req.wLength, 0, reqIn->sizeIn);
    req.pData = mem;

    res = mem->prepare();
    if(res == kIOReturnSuccess)
        res = pipeObj->controlRequest(&req);
    mem->complete();
    mem->release();
    if(res == kIOReturnSuccess) {
        *sizeOut = req.wLenDone;
    }
    else {
        IOLog("IOUSBUserClient::ControlReqInOOL err:0x%x\n", res);
        *sizeOut = 0;
    }
    *outCount = sizeof(UInt32);

    return res;
}

typedef struct AsyncPB {
    OSAsyncReference fAsyncRef;
    UInt32 fMax;
    IOMemoryDescriptor *fMem;
};

IOReturn
IOUSBUserClient::ControlReqInAsync(OSAsyncReference asyncRef,
                                   DevReqOOL *reqIn, IOByteCount inCount)
{
    IOReturn 			res;
    IOUSBDevRequestDesc		req;
    IOUSBPipe *			pipeObj;

    IOUSBCompletion		tap;
    AsyncPB * 			pb = NULL;
    IOMemoryDescriptor *	mem = NULL;

    if(inCount != sizeof(DevReqOOL))
        return kIOReturnBadArgument;

    pipeObj = fPipes[reqIn->pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    do {
        mem = IOMemoryDescriptor::withAddress((vm_address_t)reqIn->buf,
                                            reqIn->sizeIn,
                                            kIODirectionIn,
                                            fTask);
        if(!mem) {
            res = kIOReturnNoMemory;
            break;
        }
        res = mem->prepare();
        if(res != kIOReturnSuccess)
            break;
        pb = (AsyncPB *)IOMalloc(sizeof(AsyncPB));
        if(!pb) {
            res = kIOReturnNoMemory;
            break;
        }

        req.rqDirection = kUSBIn;
        req.rqType = (reqIn->bmreqtype >> kUSBRqTypeShift) & kUSBRqTypeMask;
        req.rqRecipient = reqIn->bmreqtype & kUSBRqRecipientMask;
        req.bRequest = reqIn->request;
        OSWriteLittleInt16(&req.wValue, 0, reqIn->wValue);
        OSWriteLittleInt16(&req.wIndex, 0, reqIn->wIndex);
        OSWriteLittleInt16(&req.wLength, 0, reqIn->sizeIn);
        req.pData = mem;

