neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBUserClient.cpp
        bcopy(asyncRef, pb->fAsyncRef, sizeof(OSAsyncReference));
        pb->fMax = reqIn->sizeIn;
        pb->fMem = mem;
        tap.target = this;
        tap.action = &ReqComplete;
        tap.parameter = pb;
        res = pipeObj->controlRequest(&req, &tap);

    } while (false);
    
    if(res != kIOReturnSuccess) {
        IOLog("ControlReqInAsync err 0x%x\n", res);
        if(mem) {
            mem->complete();
            mem->release();
        }
        if(pb)
            IOFree(pb, sizeof(*pb));
    }

    return res;
}

void
IOUSBUserClient::ReqComplete(void *obj, void *param, IOReturn res, UInt32 remaining)
{
    void *	args[1];
    AsyncPB * pb = (AsyncPB *)param;

    if(res == kIOReturnSuccess) {
        args[0] = (void *)(pb->fMax - remaining);
    }
    else {
        IOLog("IOUSBUserClient::ReqComplete err:0x%x\n", res);
        args[0] = 0;
    }
    pb->fMem->complete();
    pb->fMem->release();
    sendAsyncResult(pb->fAsyncRef, res, args, 1);

    IOFree(pb, sizeof(*pb));
}

IOReturn
IOUSBUserClient::ControlReqOutOOL(DevReqOOL *reqIn, IOByteCount inCount)
{
    IOReturn 			res;
    IOUSBDevRequestDesc		req;
    IOMemoryDescriptor *	mem;
    IOUSBPipe *			pipeObj;

    if(inCount != sizeof(DevReqOOL))
        return kIOReturnBadArgument;

    pipeObj = fPipes[reqIn->pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;


    mem = IOMemoryDescriptor::withAddress((vm_address_t)reqIn->buf,
		reqIn->sizeIn, kIODirectionOut, fTask);
    if(!mem) {
        return kIOReturnNoMemory;
    }
    req.rqDirection = kUSBOut;
    req.rqType = (reqIn->bmreqtype >> kUSBRqTypeShift) & kUSBRqTypeMask;
    req.rqRecipient = reqIn->bmreqtype & kUSBRqRecipientMask;
    req.bRequest = reqIn->request;
    OSWriteLittleInt16(&req.wValue, 0, reqIn->wValue);
    OSWriteLittleInt16(&req.wIndex, 0, reqIn->wIndex);
    OSWriteLittleInt16(&req.wLength, 0, reqIn->sizeIn);
    req.pData = mem;

    res = mem->prepare();
    if(res == kIOReturnSuccess)
        res = pipeObj->controlRequest(&req);
    mem->complete();
    mem->release();
    return res;
}

IOReturn
IOUSBUserClient::ControlReqOutAsync(OSAsyncReference asyncRef,
                    DevReqOOL *reqIn, IOByteCount inCount)
{
    IOReturn 			res;
    IOUSBDevRequestDesc		req;
    IOUSBPipe *			pipeObj;

    IOUSBCompletion		tap;
    AsyncPB * 			pb = NULL;
    IOMemoryDescriptor *	mem = NULL;

    if(inCount != sizeof(DevReqOOL))
        return kIOReturnBadArgument;

    pipeObj = fPipes[reqIn->pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    do {
        mem = IOMemoryDescriptor::withAddress((vm_address_t)reqIn->buf,
                                            reqIn->sizeIn,
                                            kIODirectionOut,
                                            fTask);
        if(!mem) {
            res = kIOReturnNoMemory;
            break;
        }
        res = mem->prepare();
        if(res != kIOReturnSuccess)
            break;
        pb = (AsyncPB *)IOMalloc(sizeof(AsyncPB));
        if(!pb) {
            res = kIOReturnNoMemory;
            break;
        }

        req.rqDirection = kUSBOut;
        req.rqType = (reqIn->bmreqtype >> kUSBRqTypeShift) & kUSBRqTypeMask;
        req.rqRecipient = reqIn->bmreqtype & kUSBRqRecipientMask;
        req.bRequest = reqIn->request;
        OSWriteLittleInt16(&req.wValue, 0, reqIn->wValue);
        OSWriteLittleInt16(&req.wIndex, 0, reqIn->wIndex);
        OSWriteLittleInt16(&req.wLength, 0, reqIn->sizeIn);
        req.pData = mem;

        bcopy(asyncRef, pb->fAsyncRef, sizeof(OSAsyncReference));
        pb->fMax = reqIn->sizeIn;
        pb->fMem = mem;
        tap.target = this;
        tap.action = &ReqComplete;	// Want same number of reply args as for ControlReqIn
        tap.parameter = pb;
        res = pipeObj->controlRequest(&req, &tap);

    } while (false);

    if(res != kIOReturnSuccess) {
        IOLog("controlRequest err 0x%x\n", res);
        if(mem) {
            mem->complete();
            mem->release();
        }
        if(pb)
            IOFree(pb, sizeof(*pb));
    }

    return res;
}


// Controlling pipe state

IOReturn IOUSBUserClient::getPipeStatus(UInt32 pipe)
{
    IOUSBPipe *pipeObj;
    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;
    return pipeObj->status();
}

IOReturn IOUSBUserClient::abortPipe(UInt32 pipe)
{
    IOUSBPipe *pipeObj;
    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;
    return pipeObj->abort();
}

IOReturn IOUSBUserClient::resetPipe(UInt32 pipe)
{
    IOUSBPipe *pipeObj;
    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;
    return pipeObj->reset();
}

IOReturn IOUSBUserClient::setPipeIdle(UInt32 pipe)
{
    return(0);
}

IOReturn IOUSBUserClient::setPipeActive(UInt32 pipe)
{
    return(0);
}

IOReturn IOUSBUserClient::clearPipeStall(UInt32 pipe)
{
    IOUSBPipe *pipeObj;
    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;
    return pipeObj->clearStall();
}

IOReturn
IOUSBUserClient::ReadPipe(UInt32 pipe, void *buf, UInt32 *size)
{
    IOReturn 			res;
    IOMemoryDescriptor *	mem;
    IOUSBPipe *			pipeObj;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    mem = IOMemoryDescriptor::withAddress(buf, *size, kIODirectionIn);
    if(!mem) {
        *size = 0;
        return kIOReturnNoMemory;
    }
    res = pipeObj->read(mem, 0, size);
    if(kIOReturnSuccess != res)
        *size = 0;
    mem->release();

    return res;
}

IOReturn
IOUSBUserClient::WritePipe(UInt32 pipe, void *buf, UInt32 size)
{
    IOReturn 			res;
    IOMemoryDescriptor *	mem;
    IOUSBPipe *			pipeObj;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    mem = IOMemoryDescriptor::withAddress(buf, size, kIODirectionOut);
    if(!mem) {
        res = kIOReturnNoMemory;
    }
    else {
        res = pipeObj->write(mem);
        mem->release();
    }
    return res;
}

