neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBUserClient.cpp
/*
 * Out of line version of read pipe - the buffer isn't mapped (yet) into the kernel task
 */
IOReturn
IOUSBUserClient::ReadPipeOOL(UInt32 pipe, void *buf, UInt32 sizeIn, UInt32 *sizeOut)
{
    IOReturn 			res;
    IOMemoryDescriptor *	mem;
    IOUSBPipe *			pipeObj;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    mem = IOMemoryDescriptor::withAddress((vm_address_t)buf, sizeIn,
                                          kIODirectionIn,
                                          fTask);
    if(!mem) {
        *sizeOut = 0;
        return kIOReturnNoMemory;
    }
    res = mem->prepare();
    if(res == kIOReturnSuccess)
        res = pipeObj->read(mem, 0, sizeOut);
    mem->complete();
    if(kIOReturnSuccess != res)
        *sizeOut = 0;
    mem->release();

    return res;
}

/*
 * Out of line version of write pipe - the buffer isn't mapped (yet) into the kernel task
 */
IOReturn
IOUSBUserClient::WritePipeOOL(UInt32 pipe, void *buf, UInt32 size)
{
    IOReturn 			res;
    IOMemoryDescriptor *	mem;
    IOUSBPipe *			pipeObj;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    mem = IOMemoryDescriptor::withAddress((vm_address_t)buf, size,
                                          kIODirectionOut,
                                          fTask);
    if(!mem) {
        res = kIOReturnNoMemory;
    }
    else {
        res = mem->prepare();
        if(res == kIOReturnSuccess)
            res = pipeObj->write(mem);
        mem->complete();
        mem->release();
    }
    return res;
}

/*
 * Async version of read pipe - the buffer isn't mapped (yet) into the kernel task
 */
IOReturn
IOUSBUserClient::ReadPipeAsync(OSAsyncReference asyncRef,
                               UInt32 pipe, void *buf, UInt32 size)
{
    IOReturn 			res;
    IOUSBPipe *			pipeObj;
    IOUSBCompletion		tap;
    IOMemoryDescriptor *	mem = NULL;
    AsyncPB * 			pb = NULL;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    do {
        mem = IOMemoryDescriptor::withAddress((vm_address_t)buf, size,
                                            kIODirectionIn,
                                            fTask);
        if(!mem) {
            res = kIOReturnNoMemory;
            break;
        }
        res = mem->prepare();
        if(res != kIOReturnSuccess)
            break;

        pb = (AsyncPB *)IOMalloc(sizeof(AsyncPB));
        if(!pb) {
            res = kIOReturnNoMemory;
            break;
        }

        bcopy(asyncRef, pb->fAsyncRef, sizeof(OSAsyncReference));
        pb->fMax = size;
        pb->fMem = mem;
        tap.target = this;
        tap.action = &ReqComplete;
        tap.parameter = pb;
        res = pipeObj->read(mem, &tap, NULL);
    } while (false);
    if(res != kIOReturnSuccess) {
        if(mem) {
            mem->complete();
            mem->release();
        }
        if(pb)
            IOFree(pb, sizeof(*pb));
    }

    return res;
}

/*
 * Async version of write pipe - the buffer isn't mapped (yet) into the kernel task
 */
IOReturn
IOUSBUserClient::WritePipeAsync(OSAsyncReference asyncRef,
                                UInt32 pipe, void *buf, UInt32 size)
{
    IOReturn 			res;
    IOUSBPipe *			pipeObj;
    IOUSBCompletion		tap;
    IOMemoryDescriptor *	mem = NULL;
    AsyncPB * 			pb = NULL;

    pipeObj = fPipes[pipe];
    if(!pipeObj)
        return kIOUSBUnknownPipeErr;

    do {
        mem = IOMemoryDescriptor::withAddress((vm_address_t)buf, size,
                                            kIODirectionOut,
                                            fTask);
        if(!mem) {
            res = kIOReturnNoMemory;
            break;
        }
        res = mem->prepare();
        if(res != kIOReturnSuccess)
            break;

        pb = (AsyncPB *)IOMalloc(sizeof(AsyncPB));
        if(!pb) {
            res = kIOReturnNoMemory;
            break;
        }

        bcopy(asyncRef, pb->fAsyncRef, sizeof(OSAsyncReference));
        pb->fMax = size;
        pb->fMem = mem;
        tap.target = this;
        tap.action = &ReqComplete;
        tap.parameter = pb;
        res = pipeObj->write(mem, &tap);
    } while (false);
    if(res != kIOReturnSuccess) {
        if(mem) {
            mem->complete();
            mem->release();
        }
        if(pb)
            IOFree(pb, sizeof(*pb));
    }
    return res;
}

IOReturn IOUSBUserClient::ClosePipe(UInt32 pipe)
{
    fPipes[pipe] = 0;
    return kIOReturnSuccess;
}

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

OSDefineMetaClassAndStructors(IOUSBDeviceUserClient, IOUSBUserClient)

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

IOUSBDeviceUserClient *IOUSBDeviceUserClient::withTask(task_t owningTask)
{
    IOUSBDeviceUserClient *me;

    me = new IOUSBDeviceUserClient;
    if(me) {
        if(!me->init()) {
            me->release();
            return NULL;
        }
        me->fTask = owningTask;
    }
    return me;
}

bool IOUSBDeviceUserClient::start( IOService * provider )
{
    assert(OSDynamicCast(IOUSBDevice, provider));
    if(!IOUSBUserClient::start(provider))
        return false;
    fOwner = (IOUSBDevice *)provider;
    fOwner->retain();
    fInterfaces = OSSet::withCapacity(1);
    if(!fInterfaces)
        return false;

    // initialize the call structures valid for IOUSBDevice
    fMethods[kUSBSetConfig].object = provider;
    fMethods[kUSBSetConfig].func = (IOMethod)&IOUSBDevice::SetConfiguration;
    fMethods[kUSBSetConfig].count0 = 1;
    fMethods[kUSBSetConfig].count1 = 0;
    fMethods[kUSBSetConfig].flags = kIOUCScalarIScalarO;

    fMethods[kUSBGetConfigDescriptor].object = this;
    fMethods[kUSBGetConfigDescriptor].func =
        (IOMethod)&IOUSBDeviceUserClient::GetConfigDescriptor;
    fMethods[kUSBGetConfigDescriptor].count0 = 1;
    fMethods[kUSBGetConfigDescriptor].count1 = 0xffffffff; // variable
    fMethods[kUSBGetConfigDescriptor].flags = kIOUCScalarIStructO;

    fMethods[kUSBOpenPipe].object = this;
    fMethods[kUSBOpenPipe].func =
        (IOMethod)&IOUSBDeviceUserClient::OpenPipe;
    fMethods[kUSBOpenPipe].count0 = 4;
    fMethods[kUSBOpenPipe].count1 = 1;
    fMethods[kUSBOpenPipe].flags = kIOUCScalarIScalarO;

