neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBUserClient.cpp
    fMethods[kUSBResetDevice].object = provider;
    fMethods[kUSBResetDevice].func =
        (IOMethod)&IOUSBDevice::resetDevice;
    fMethods[kUSBResetDevice].count0 = 0;
    fMethods[kUSBResetDevice].count1 = 0;
    fMethods[kUSBResetDevice].flags = kIOUCScalarIScalarO;

    return true;
}

IOReturn IOUSBDeviceUserClient::clientClose( void )
{
    if(fInterfaces) {
        OSCollectionIterator *iter;

        iter = OSCollectionIterator::withCollection(fInterfaces);
        if(iter) {
            OSObject *obj;
            while( (obj=iter->getNextObject()) ) {
                ((IOService *)obj)->close(this);
            }
            iter->release();
        }
        fInterfaces->release();
        fInterfaces = NULL;
    }
    if(fOwner) {
        detach( fOwner);
        fOwner->release();
        fOwner = NULL;
    }
    return IOUSBUserClient::clientClose();
}

IOReturn
IOUSBDeviceUserClient::OpenPipe(UInt32 configIndex,
                          UInt32 intfNo, UInt32 altSet, UInt32 endPtOff, UInt32 *pipe)
{
    IOReturn res;
    IOUSBInterface *intf;
    const IOUSBInterfaceDescriptor *id = NULL;
    UInt8 configVal;
    IOUSBDevice::FindInterfaceRequest request;
    UInt32 i;
    const IOUSBConfigurationDescriptor *config;

    config = fOwner->getFullConfigurationDescriptor(configIndex);
    configVal = config->configValue;

    intf = NULL;
    request.theClass = 0;
    request.subClass = 0;
    request.protocol = 0;
    request.maxPower = 0;

    while( (intf = fOwner->findNextInterface(intf, &request))) {
        if(intf->getConfigValue() == configVal) {
            id = intf->interfaceDescriptor();
            if(id->interfaceNumber == intfNo &&
                    id->alternateSetting == altSet)
                break;
        }
        intf->release();
        // Reset request fields to wildcard values.
        request.theClass = 0;
        request.subClass = 0;
        request.protocol = 0;
        request.maxPower = 0;
    }

    if(!intf)
        return kIOUSBInterfaceNotFound;

    if(id->numEndpoints <= endPtOff)
        return kIOUSBUnknownPipeErr;

    do {
        IOUSBFindEndpointRequest findPipe;
        IOUSBPipe *pipeObj;
        if(!fInterfaces->member(intf)) {
            if(!intf->open(this)) {
                res = kIOReturnExclusiveAccess;
                break;
            }
            fInterfaces->setObject(intf);
        }

        // Loop through pipes the requested number of times
        pipeObj = NULL;
        endPtOff++; // Easier to be 1-based.
        for(i=0; i<endPtOff; i++) {
            findPipe.type = kUSBAnyType;
            findPipe.direction = kUSBAnyDirn;
            pipeObj = intf->findNextPipe(pipeObj, &findPipe);
            if(pipeObj == NULL) {
                res = kIOUSBEndpointNotFound;
                break;
            }
        }
        if(i != endPtOff) {
           res = kIOUSBEndpointNotFound;
            break;
        }
        for(i=1; i<kUSBMaxPipes; i++) {
            if(!fPipes[i]) {
                fPipes[i] = pipeObj;
                break;
            }
        }
        if(i >= kUSBMaxPipes) {
            res = kIOUSBTooManyPipesErr;
            break;
        }
        *pipe = i;
        res = kIOReturnSuccess;
    } while(false);
    if(intf)
        intf->release();
    return res;
}

IOReturn
IOUSBDeviceUserClient::GetConfigDescriptor(UInt8 configIndex,
                        IOUSBConfigurationDescriptorPtr desc, UInt32 *size)
{
    UInt16 length;
    const IOUSBConfigurationDescriptor *cached;

    cached = fOwner->getFullConfigurationDescriptor(configIndex);
    length = OSReadLittleInt16(&cached->totalLength, 0);
    if(length < *size)
        *size = length;
    bcopy(cached, desc, *size);
    return kIOReturnSuccess;
}

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

OSDefineMetaClassAndStructors(IOUSBInterfaceUserClient, IOUSBUserClient)

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

IOUSBInterfaceUserClient *IOUSBInterfaceUserClient::withTask(task_t owningTask)
{
    IOUSBInterfaceUserClient *me;

    me = new IOUSBInterfaceUserClient;
    if(me) {
        if(!me->init()) {
            me->release();
            return NULL;
        }
        me->fTask = owningTask;
    }
    return me;
}

bool IOUSBInterfaceUserClient::start( IOService * provider )
{
    assert(OSDynamicCast(IOUSBInterface, provider));
    if(!IOUSBUserClient::start(provider))
        return false;
    fOwner = (IOUSBInterface *)provider;
    fOwner->retain();

// initialize the call structures valid for IOUSBInterface
    fMethods[kUSBGetConfigDescriptor].object = this;
    fMethods[kUSBGetConfigDescriptor].func =
        (IOMethod)&IOUSBInterfaceUserClient::GetConfigDescriptor;
    fMethods[kUSBGetConfigDescriptor].count0 = 1;
    fMethods[kUSBGetConfigDescriptor].count1 = 0xffffffff; // variable
    fMethods[kUSBGetConfigDescriptor].flags = kIOUCScalarIStructO;

    fMethods[kUSBOpenPipe].object = this;
    fMethods[kUSBOpenPipe].func =
        (IOMethod)&IOUSBInterfaceUserClient::OpenPipe;
    fMethods[kUSBOpenPipe].count0 = 4;
    fMethods[kUSBOpenPipe].count1 = 1;
    fMethods[kUSBOpenPipe].flags = kIOUCScalarIScalarO;

    return true;
}

IOReturn IOUSBInterfaceUserClient::clientClose( void )
{
    if(fOwner) {
        if(fOpen) {
            fOwner->close(this);
            fOpen = false;
	}
        detach( fOwner);
        fOwner->release();
        fOwner = NULL;
    }
    return IOUSBUserClient::clientClose();
}

IOReturn
IOUSBInterfaceUserClient::OpenPipe(UInt32 configIndex,
                          UInt32 intfNo, UInt32 altSet, UInt32 endPtOff, UInt32 *pipe)
{
    IOReturn res;
    const IOUSBInterfaceDescriptor *id = fOwner->interfaceDescriptor();
    UInt32 i;
    const IOUSBConfigurationDescriptor *config;

    config = fOwner->device()->getFullConfigurationDescriptor(configIndex);

    if(config->configValue != fOwner->getConfigValue())
        return kIOUSBConfigNotFound;

    if(intfNo != id->interfaceNumber ||
       altSet != id->alternateSetting)
        return kIOUSBInterfaceNotFound;

    if(id->numEndpoints <= endPtOff)
        return kIOUSBUnknownPipeErr;

    do {
        IOUSBFindEndpointRequest findPipe;
        IOUSBPipe *pipeObj;
        if(!fOpen) {
            if(!fOwner->open(this)) {
                res = kIOReturnExclusiveAccess;
                break;
            }
            fOpen = true;
        }

        // Loop through pipes the requested number of times
        pipeObj = NULL;
        endPtOff++; // Easier to be 1-based.
        for(i=0; i<endPtOff; i++) {
            findPipe.type = kUSBAnyType;
            findPipe.direction = kUSBAnyDirn;
            pipeObj = fOwner->findNextPipe(pipeObj, &findPipe);
            if(pipeObj == NULL) {
                res = kIOUSBEndpointNotFound;
                break;
            }
        }
        if(i != endPtOff) {
           res = kIOUSBEndpointNotFound;
            break;
        }
        for(i=1; i<kUSBMaxPipes; i++) {
            if(!fPipes[i]) {
                fPipes[i] = pipeObj;
                break;
            }
        }
        if(i >= kUSBMaxPipes) {
            res = kIOUSBTooManyPipesErr;
            break;
        }
        *pipe = i;
        res = kIOReturnSuccess;
    } while(false);
    return res;
}

IOReturn
IOUSBInterfaceUserClient::GetConfigDescriptor(UInt8 configIndex,
                        IOUSBConfigurationDescriptorPtr desc, UInt32 *size)
{
    UInt16 length;
    const IOUSBConfigurationDescriptor *cached;

    cached = fOwner->device()->getFullConfigurationDescriptor(configIndex);
    length = OSReadLittleInt16(&cached->totalLength, 0);
    if(length < *size)
        *size = length;
    bcopy(cached, desc, *size);
    return kIOReturnSuccess;
}
